#include <stdio.h>
//xronos O(n^2) xoros O(1)

void swap(int *a, int *b) {
    int tmp = *a;
    *a = *b;
    *b = tmp;
}
void selection_sort(int n, int *x) {
    int i, j, min;
    for (i = 1 ; i <= n - 1 ; i++){
        min = i - 1;
        for (j = i ; j <= n - 1 ; j++){
            if (x[j] < x[min]){
                min = j;
                swap(&x[i-1], &x[min]);
            }
        }
    }
}
int main() {
    int n = 10;
    int x[10] = {1,2,5,7,3,4,8,1,2};
    selection_sort(n,x);
    for(int i = 0;i < 10;i++){
        printf("%02d\n", x[i]);
    }
    return 0;
}

// //Πώς Λειτουργεί ο Selection Sort:
// Διαίρεση του πίνακα:

// Ο πίνακας χωρίζεται σε δύο μέρη:
// Το ταξινομημένο μέρος (που αρχικά είναι κενό).
// Το αταξινόμητο μέρος (όλος ο πίνακας στην αρχή).
// Βρες το ελάχιστο στοιχείο:

// Εντόπισε το μικρότερο στοιχείο από τον αταξινόμητο πίνακα.
// Αντάλλαξε το μικρότερο στοιχείο:

// Αντάλλαξε το μικρότερο στοιχείο με το πρώτο στοιχείο του αταξινόμητου μέρους.
// Το μικρότερο στοιχείο προστίθεται στο ταξινομημένο μέρος.
// Επανέλαβε:

// Επανάλαβε τη διαδικασία για τον υπόλοιπο πίνακα, μειώνοντας το αταξινόμητο μέρος κατά ένα στοιχείο κάθε φορά.
// Σταμάτησε:

// Όταν όλα τα στοιχεία έχουν τοποθετηθεί στη σωστή τους θέση, ο πίνακας είναι ταξινομημένος.