
#include <stdio.h>
//O(n^2) O(1)

void swap(int *a, int *b) {
    int tmp = *a;
    *a = *b;
    *b = tmp;
}
void bubblesort(int n, int *x) {
    int i, j;
    for (i = 0 ; i < n - 1 ; i++){
        for (j = 0; j < n - i - 1 ; j++){
            if (x[j+1] > x[j]){
                swap(&x[j+1], &x[j]);
            }
        }
    }
}
int main(){
    int n = 10;
    int x[10] = {1,2,5,7,3,4,8,1,2,10};
    bubblesort(n,x);
    for(int i = 0;i < 10;i++){
        printf("%02d\n", x[i]);
    }
    return 0;
}

// Ο αλγόριθμος Bubble Sort λειτουργεί ως εξής:

// Στην αρχή, κάθε στοιχείο του πίνακα συγκρίνεται με το επόμενο γειτονικο και αν το πρώτο είναι μεγαλύτερο από το δεύτερο, τα δύο στοιχεία ανταλλάσσονται.
// Με την κάθε επανάληψη, το μεγαλύτερο στοιχείο "ανεβαίνει" στο τέλος του πίνακα.
// Στο τέλος, οι υπόλοιποι αριθμοί είναι σωστά ταξινομημένοι και ο πίνακας ολοκληρώνει τη διαδικασία.
